[
  {
    "id": 1,
    "name": "Special Birthday | Event Management | JobHive Hiring Agency Platform",
    "images": "https://github.com/Anondoraydev/glorebd-repo",
    "image": "https://i.ibb.co/6kLHbqH/Screenshot-2024-10-25-200015.png",
    "stack": ["React Js", "DaisyUi", "Tailwind CSS", "Node.js", "Firebase"],
    "description": "This project combines three platforms into one showcase:\n\n1. **Special Birthday** – A birthday event planning app with invite system, countdown timer, and personalized wishes.\n2. **Event Management** – A full-featured event planner for weddings, corporate events, and cultural programs.\n3. **JobHive Hiring Agency Platform** – A hiring and communication platform for job seekers and recruiters to interact, post jobs, and conduct interviews.",
    "liveLink": "https://event-mangment-hazel.vercel.app",
    "github": "https://github.com/Anondoraydev/event-mangment",
    "challenges": "Handling multiple user roles across three different types of apps, ensuring secure API access and proper role-based functionality.",
    "improvements": "Role-based access, Firebase live updates, WebSocket integration, and secured API with JWT for all platforms have been implemented to ensure a robust and real-time experience."
  },
  {
    "id": 2,
    "name": "My Awesome Shop",
    "images": "https://i.ibb.co/KpNgPw7t/Screenshot-2025-06-09-112546.png",
    "image": "https://i.ibb.co/KpNgPw7t/Screenshot-2025-06-09-112546.png",
    "stack": ["React.js", "Redux", "Tailwind CSS", "Node.js", "Stripe API"],
    "description": "This is a full-featured e-commerce website where users can browse products, add items to cart, and securely checkout using Stripe payment gateway. Admins can add, update, or delete products and manage orders.",
    "liveLink": "https://glorebd-repo.vercel.app/",
    "github": "https://github.com/Anondoraydev/glorebd-repo",
    "challenges": "Implementing secure payment integration and managing complex state with Redux were the major challenges.",
    "improvements": "Added JWT authentication for users and admins, optimized product filtering and search for better UX."
  },

  {
    "id": 3,
    "name": "Home Repair Service",
    "image": "https://i.ibb.co/6kLHbqH/Screenshot-2024-10-25-200015.png",
    "stack": [
      "React Js",
      "DaisyUi",
      "Tailwind CSS",
      "Express.js",
      "Node.js",
      "MongoDB",
      "Node.js",
      "Firebase"
    ],
    
    "description": "The home repair service website is a platform where users can easily purchase home services. Additionally, anyone can act as an admin to post their own services and provide them, while also being able to avail other services. However, users cannot purchase the services they have posted themselves.",
    "liveLink": "https://steep-silk.surge.sh/",
    "github": "https://github.com/Anondoraydev/react-career-hub-repo",
    "challenges": "Developing an API to efficiently manage services posed a considerable challenge for me.",
    "improvements": "I have implemented JWT token-based authentication to secure all essential APIs, ensuring robust security."
  },
  {
    "id": 4,
    "name": "Blood Donor Camp",
    "image": "https://i.ibb.co.com/2JBFGtD/blood-Donor.png",
    "stack": [
      "React Js",
      "DaisyUi",
      "Tailwind CSS",
      "Express.js",
      "Node.js",
      "MongoDB",
      "Node.js",
      "Firebase"
    ],
    "description": "It’s a comprehensive blood donation platform where users can create accounts to register as blood donors or recipients. In times of need, users can directly contact blood donors based on their location. The platform aims to provide an efficient and secure way for individuals to find and connect with potential blood donors, ensuring timely access to blood donations in critical situations.",
    "liveLink": "https://steep-silk.surge.sh/",
    "github": "https://github.com/Anondoraydev/react-career-hub-repo",
    "challenges": "I didn’t face any major problems, but developing the APIs did present some challenges.",
    "improvements": "I implemented a feedback form to allow users to submit their suggestions and opinions, ensuring valuable input for continuous improvement."
  }
]
